// Тема 02 - Массив классов

#include <iostream>

using namespace std;

class Student{
public:
    string name;     
    unsigned age;       
};

int main()
{
    // Экземпляры класса можно занести в массив.
    // Тип массива определяется типом класса, которые он хранит
    
    Student student1;
    Student student2;
    Student student3;
    
    student1.name = "Bob";
    student1.age = 18;
    student2.name = "John";
    student2.age = 22;
    student3.name = "Ivan";
    student3.age = 20;
    
    // Занесем экземпляры класса в массив
    Student student_array[3] = {student1, student2, student3};
    
    // Также в массив классов можно заносить экземпляры напрямую, в т.ч. и безразмерный массив
    Student student_array2[] = {{"Eddy", 21}, {"Roman", 24}};
    
    // Обращение к элементам массива классов происходит по индексу
    cout << student_array2[1].name << endl;
    
    // Перебор массива классов циклом
    for (int i = 0; i < 2; i++){
        cout << student_array[i].name << " " << student_array[i].age << endl;
        }
    
    // И также как с массивами других типов с массивами классов можно использовать указатели:
    int n = sizeof(student_array2)/sizeof(student_array2[0]);
    for(class Student *s=student_array2; s < student_array2+n; s++)
    {
        cout << s->name << " " << s->age<< endl;
    }
    
    // Задачи
    
    /*1. Создайте массив классов, содержащий информацию о студентах (имя, фамилия, возраст, средний балл). 
    Напишите программу, которая выводит на экран данные о студентах, чей средний балл выше заданного значения.*/
    
    /*2. Создайте массив классов, содержащий информацию о кругах (координаты центра и радиус). 
    Напишите программу, которая находит круг с максимальной площадью и выводит его координаты и радиус на экран*/
    
    /*3. Создайте массив классов, содержащий информацию о работниках компании (имя, должность, зарплата). 
    Напишите программу, которая сортирует массив по зарплате работников в порядке возрастания и выводит 
    на экран отсортированный массив.*/
    
    /* 4. Создайте массив классов, содержащий информацию о прямоугольниках (координаты вершин). 
    Напишите программу, которая находит периметр прямоугольника с наименьшей площадью и выводит его на экран.*/
    
    /* 5. Создайте массив классов, содержащий информацию о городах (название, население, страна). 
    Напишите программу, которая находит все города заданной страны. */
    
    return 0;
}
